Autodesk.Revit.DB.SaveModifiedLinksOptions
Class giving options when saving linked files which have been modified
in-memory by shared coordinates operations.
Since:
2014
Since:
2014

Autodesk.Revit.DB.SaveModifiedLinksOptions.DisableSharedPositioning
Any modified linked files will not be saved. Additionally, stop using shared
positioning with any modified files.

Autodesk.Revit.DB.SaveModifiedLinksOptions.DoNotSaveLinks
Any modified linked files will not be saved. The links will return to their previous
position the next time the file is loaded.

Autodesk.Revit.DB.SaveModifiedLinksOptions.SaveLinks
Any modified linked files will be saved.